HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_bf.h
/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC_P3 */
#define IFX_CBS_OCNTRL_OC_P3_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC_P3 */
#define IFX_CBS_OCNTRL_OC_P3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC_P3 */
#define IFX_CBS_OCNTRL_OC_P3_OFF (6u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC3 */
#define IFX_CBS_OCNTRL_OC3_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC3 */
#define IFX_CBS_OCNTRL_OC3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC3 */
#define IFX_CBS_OCNTRL_OC3_OFF (7u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC_P4 */
#define IFX_CBS_OCNTRL_OC_P4_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC_P4 */
#define IFX_CBS_OCNTRL_OC_P4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC_P4 */
#define IFX_CBS_OCNTRL_OC_P4_OFF (8u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC4 */
#define IFX_CBS_OCNTRL_OC4_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC4 */
#define IFX_CBS_OCNTRL_OC4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC4 */
#define IFX_CBS_OCNTRL_OC4_OFF (9u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC_P5 */
#define IFX_CBS_OCNTRL_OC_P5_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC_P5 */
#define IFX_CBS_OCNTRL_OC_P5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC_P5 */
#define IFX_CBS_OCNTRL_OC_P5_OFF (10u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OC5 */
#define IFX_CBS_OCNTRL_OC5_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OC5 */
#define IFX_CBS_OCNTRL_OC5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OC5 */
#define IFX_CBS_OCNTRL_OC5_OFF (11u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.WDTSUS_P */
#define IFX_CBS_OCNTRL_WDTSUS_P_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.WDTSUS_P */
#define IFX_CBS_OCNTRL_WDTSUS_P_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.WDTSUS_P */
#define IFX_CBS_OCNTRL_WDTSUS_P_OFF (12u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.WDTSUS */
#define IFX_CBS_OCNTRL_WDTSUS_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.WDTSUS */
#define IFX_CBS_OCNTRL_WDTSUS_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.WDTSUS */
#define IFX_CBS_OCNTRL_WDTSUS_OFF (13u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.STABLE_P */
#define IFX_CBS_OCNTRL_STABLE_P_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.STABLE_P */
#define IFX_CBS_OCNTRL_STABLE_P_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.STABLE_P */
#define IFX_CBS_OCNTRL_STABLE_P_OFF (14u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.STABLE */
#define IFX_CBS_OCNTRL_STABLE_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.STABLE */
#define IFX_CBS_OCNTRL_STABLE_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.STABLE */
#define IFX_CBS_OCNTRL_STABLE_OFF (15u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P0 */
#define IFX_CBS_OCNTRL_OJC_P0_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P0 */
#define IFX_CBS_OCNTRL_OJC_P0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P0 */
#define IFX_CBS_OCNTRL_OJC_P0_OFF (16u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC0 */
#define IFX_CBS_OCNTRL_OJC0_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC0 */
#define IFX_CBS_OCNTRL_OJC0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC0 */
#define IFX_CBS_OCNTRL_OJC0_OFF (17u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P1 */
#define IFX_CBS_OCNTRL_OJC_P1_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P1 */
#define IFX_CBS_OCNTRL_OJC_P1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P1 */
#define IFX_CBS_OCNTRL_OJC_P1_OFF (18u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC1 */
#define IFX_CBS_OCNTRL_OJC1_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC1 */
#define IFX_CBS_OCNTRL_OJC1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC1 */
#define IFX_CBS_OCNTRL_OJC1_OFF (19u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P2 */
#define IFX_CBS_OCNTRL_OJC_P2_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P2 */
#define IFX_CBS_OCNTRL_OJC_P2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P2 */
#define IFX_CBS_OCNTRL_OJC_P2_OFF (20u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC2 */
#define IFX_CBS_OCNTRL_OJC2_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC2 */
#define IFX_CBS_OCNTRL_OJC2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC2 */
#define IFX_CBS_OCNTRL_OJC2_OFF (21u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P3 */
#define IFX_CBS_OCNTRL_OJC_P3_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P3 */
#define IFX_CBS_OCNTRL_OJC_P3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P3 */
#define IFX_CBS_OCNTRL_OJC_P3_OFF (22u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC3 */
#define IFX_CBS_OCNTRL_OJC3_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC3 */
#define IFX_CBS_OCNTRL_OJC3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC3 */
#define IFX_CBS_OCNTRL_OJC3_OFF (23u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P4 */
#define IFX_CBS_OCNTRL_OJC_P4_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P4 */
#define IFX_CBS_OCNTRL_OJC_P4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P4 */
#define IFX_CBS_OCNTRL_OJC_P4_OFF (24u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC4 */
#define IFX_CBS_OCNTRL_OJC4_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC4 */
#define IFX_CBS_OCNTRL_OJC4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC4 */
#define IFX_CBS_OCNTRL_OJC4_OFF (25u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P5 */
#define IFX_CBS_OCNTRL_OJC_P5_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC_P5 */
#define IFX_CBS_OCNTRL_OJC_P5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC_P5 */
#define IFX_CBS_OCNTRL_OJC_P5_OFF (26u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC5 */
#define IFX_CBS_OCNTRL_OJC5_LEN (1u)

/** \brief Mask for Ifx_CBS_OCNTRL_Bits.OJC5 */
#define IFX_CBS_OCNTRL_OJC5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_OCNTRL_Bits.OJC5 */
#define IFX_CBS_OCNTRL_OJC5_OFF (27u)

/** \brief Length for Ifx_CBS_OCNTRL_Bits.OJC_P6 */
#define IFX_CBS_OCNTRL_OJC_P6_LEN (1u)

