HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_bf.h
/** \brief Offset for Ifx_CBS_TL1ST_Bits.C0 */
#define IFX_CBS_TL1ST_C0_OFF (0u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C1 */
#define IFX_CBS_TL1ST_C1_OFF (1u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C2 */
#define IFX_CBS_TL1ST_C2_OFF (2u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C3 */
#define IFX_CBS_TL1ST_C3_OFF (3u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C4 */
#define IFX_CBS_TL1ST_C4_OFF (4u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.C5 */
#define IFX_CBS_TL1ST_C5_OFF (5u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M0M1M2M31 */
#define IFX_CBS_TL1ST_M0M1M2M31_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M0M1M2M31 */
#define IFX_CBS_TL1ST_M0M1M2M31_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M0M1M2M31 */
#define IFX_CBS_TL1ST_M0M1M2M31_OFF (24u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M0M1M2M32 */
#define IFX_CBS_TL1ST_M0M1M2M32_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M0M1M2M32 */
#define IFX_CBS_TL1ST_M0M1M2M32_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M0M1M2M32 */
#define IFX_CBS_TL1ST_M0M1M2M32_OFF (25u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M0M1M2M33 */
#define IFX_CBS_TL1ST_M0M1M2M33_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M0M1M2M33 */
#define IFX_CBS_TL1ST_M0M1M2M33_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M0M1M2M33 */
#define IFX_CBS_TL1ST_M0M1M2M33_OFF (26u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.M0M1M2M34 */
#define IFX_CBS_TL1ST_M0M1M2M34_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.M0M1M2M34 */
#define IFX_CBS_TL1ST_M0M1M2M34_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.M0M1M2M34 */
#define IFX_CBS_TL1ST_M0M1M2M34_OFF (27u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.HSS */
#define IFX_CBS_TL1ST_HSS_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.HSS */
#define IFX_CBS_TL1ST_HSS_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.HSS */
#define IFX_CBS_TL1ST_HSS_OFF (28u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.DMA */
#define IFX_CBS_TL1ST_DMA_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.DMA */
#define IFX_CBS_TL1ST_DMA_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.DMA */
#define IFX_CBS_TL1ST_DMA_OFF (29u)

/** \brief Length for Ifx_CBS_TL1ST_Bits.HSM */
#define IFX_CBS_TL1ST_HSM_LEN (1u)

/** \brief Mask for Ifx_CBS_TL1ST_Bits.HSM */
#define IFX_CBS_TL1ST_HSM_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TL1ST_Bits.HSM */
#define IFX_CBS_TL1ST_HSM_OFF (31u)

/** \brief Length for Ifx_CBS_TLCHE_Bits.TL1 */
#define IFX_CBS_TLCHE_TL1_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHE_Bits.TL1 */
#define IFX_CBS_TLCHE_TL1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHE_Bits.TL1 */
#define IFX_CBS_TLCHE_TL1_OFF (1u)

/** \brief Length for Ifx_CBS_TLCHE_Bits.TL2 */
#define IFX_CBS_TLCHE_TL2_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHE_Bits.TL2 */
#define IFX_CBS_TLCHE_TL2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHE_Bits.TL2 */
#define IFX_CBS_TLCHE_TL2_OFF (2u)

/** \brief Length for Ifx_CBS_TLCHE_Bits.TL3 */
#define IFX_CBS_TLCHE_TL3_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHE_Bits.TL3 */
#define IFX_CBS_TLCHE_TL3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHE_Bits.TL3 */
#define IFX_CBS_TLCHE_TL3_OFF (3u)

/** \brief Length for Ifx_CBS_TLCHS_Bits.TL1 */
#define IFX_CBS_TLCHS_TL1_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHS_Bits.TL1 */
#define IFX_CBS_TLCHS_TL1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHS_Bits.TL1 */
#define IFX_CBS_TLCHS_TL1_OFF (1u)

/** \brief Length for Ifx_CBS_TLCHS_Bits.TL2 */
#define IFX_CBS_TLCHS_TL2_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHS_Bits.TL2 */
#define IFX_CBS_TLCHS_TL2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHS_Bits.TL2 */
#define IFX_CBS_TLCHS_TL2_OFF (2u)

/** \brief Length for Ifx_CBS_TLCHS_Bits.TL3 */
#define IFX_CBS_TLCHS_TL3_LEN (1u)

/** \brief Mask for Ifx_CBS_TLCHS_Bits.TL3 */
#define IFX_CBS_TLCHS_TL3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLCHS_Bits.TL3 */
#define IFX_CBS_TLCHS_TL3_OFF (3u)

/** \brief Length for Ifx_CBS_TRIGS_Bits.BITNUM */
#define IFX_CBS_TRIGS_BITNUM_LEN (8u)

/** \brief Mask for Ifx_CBS_TRIGS_Bits.BITNUM */
#define IFX_CBS_TRIGS_BITNUM_MSK (0xffu)

/** \brief Offset for Ifx_CBS_TRIGS_Bits.BITNUM */
#define IFX_CBS_TRIGS_BITNUM_OFF (0u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx0 */
#define IFX_CBS_TRIGC_TRGX0_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx0 */
#define IFX_CBS_TRIGC_TRGX0_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx0 */
#define IFX_CBS_TRIGC_TRGX0_OFF (0u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx1 */
#define IFX_CBS_TRIGC_TRGX1_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx1 */
#define IFX_CBS_TRIGC_TRGX1_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx1 */
#define IFX_CBS_TRIGC_TRGX1_OFF (1u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx2 */
#define IFX_CBS_TRIGC_TRGX2_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx2 */
#define IFX_CBS_TRIGC_TRGX2_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx2 */
#define IFX_CBS_TRIGC_TRGX2_OFF (2u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx3 */
#define IFX_CBS_TRIGC_TRGX3_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx3 */
#define IFX_CBS_TRIGC_TRGX3_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx3 */
#define IFX_CBS_TRIGC_TRGX3_OFF (3u)

