HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_bf.h
/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx4 */
#define IFX_CBS_TRIGC_TRGX4_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx4 */
#define IFX_CBS_TRIGC_TRGX4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx4 */
#define IFX_CBS_TRIGC_TRGX4_OFF (4u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx5 */
#define IFX_CBS_TRIGC_TRGX5_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx5 */
#define IFX_CBS_TRIGC_TRGX5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx5 */
#define IFX_CBS_TRIGC_TRGX5_OFF (5u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx6 */
#define IFX_CBS_TRIGC_TRGX6_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx6 */
#define IFX_CBS_TRIGC_TRGX6_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx6 */
#define IFX_CBS_TRIGC_TRGX6_OFF (6u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx7 */
#define IFX_CBS_TRIGC_TRGX7_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx7 */
#define IFX_CBS_TRIGC_TRGX7_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx7 */
#define IFX_CBS_TRIGC_TRGX7_OFF (7u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx8 */
#define IFX_CBS_TRIGC_TRGX8_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx8 */
#define IFX_CBS_TRIGC_TRGX8_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx8 */
#define IFX_CBS_TRIGC_TRGX8_OFF (8u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx9 */
#define IFX_CBS_TRIGC_TRGX9_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx9 */
#define IFX_CBS_TRIGC_TRGX9_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx9 */
#define IFX_CBS_TRIGC_TRGX9_OFF (9u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx10 */
#define IFX_CBS_TRIGC_TRGX10_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx10 */
#define IFX_CBS_TRIGC_TRGX10_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx10 */
#define IFX_CBS_TRIGC_TRGX10_OFF (10u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx11 */
#define IFX_CBS_TRIGC_TRGX11_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx11 */
#define IFX_CBS_TRIGC_TRGX11_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx11 */
#define IFX_CBS_TRIGC_TRGX11_OFF (11u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx12 */
#define IFX_CBS_TRIGC_TRGX12_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx12 */
#define IFX_CBS_TRIGC_TRGX12_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx12 */
#define IFX_CBS_TRIGC_TRGX12_OFF (12u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx13 */
#define IFX_CBS_TRIGC_TRGX13_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx13 */
#define IFX_CBS_TRIGC_TRGX13_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx13 */
#define IFX_CBS_TRIGC_TRGX13_OFF (13u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx14 */
#define IFX_CBS_TRIGC_TRGX14_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx14 */
#define IFX_CBS_TRIGC_TRGX14_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx14 */
#define IFX_CBS_TRIGC_TRGX14_OFF (14u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.TRGx15 */
#define IFX_CBS_TRIGC_TRGX15_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.TRGx15 */
#define IFX_CBS_TRIGC_TRGX15_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.TRGx15 */
#define IFX_CBS_TRIGC_TRGX15_OFF (15u)

/** \brief Length for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_LEN (8u)

/** \brief Mask for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_MSK (0xffu)

/** \brief Offset for Ifx_CBS_TRIGC_Bits.x */
#define IFX_CBS_TRIGC_X_OFF (24u)

/** \brief Length for Ifx_CBS_TLT_Bits.TGL */
#define IFX_CBS_TLT_TGL_LEN (4u)

/** \brief Mask for Ifx_CBS_TLT_Bits.TGL */
#define IFX_CBS_TLT_TGL_MSK (0xfu)

/** \brief Offset for Ifx_CBS_TLT_Bits.TGL */
#define IFX_CBS_TLT_TGL_OFF (0u)

/** \brief Length for Ifx_CBS_TLT_Bits.VTZ */
#define IFX_CBS_TLT_VTZ_LEN (1u)

/** \brief Mask for Ifx_CBS_TLT_Bits.VTZ */
#define IFX_CBS_TLT_VTZ_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLT_Bits.VTZ */
#define IFX_CBS_TLT_VTZ_OFF (4u)

/** \brief Length for Ifx_CBS_TLT_Bits.RL */
#define IFX_CBS_TLT_RL_LEN (1u)

/** \brief Mask for Ifx_CBS_TLT_Bits.RL */
#define IFX_CBS_TLT_RL_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TLT_Bits.RL */
#define IFX_CBS_TLT_RL_OFF (5u)

/** \brief Length for Ifx_CBS_TLT_Bits.TIM */
#define IFX_CBS_TLT_TIM_LEN (16u)

/** \brief Mask for Ifx_CBS_TLT_Bits.TIM */
#define IFX_CBS_TLT_TIM_MSK (0xffffu)

/** \brief Offset for Ifx_CBS_TLT_Bits.TIM */
#define IFX_CBS_TLT_TIM_OFF (16u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL1 */
#define IFX_CBS_TLTTH_TL1_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL1 */
#define IFX_CBS_TLTTH_TL1_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL1 */
#define IFX_CBS_TLTTH_TL1_OFF (2u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL2 */
#define IFX_CBS_TLTTH_TL2_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL2 */
#define IFX_CBS_TLTTH_TL2_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL2 */
#define IFX_CBS_TLTTH_TL2_OFF (4u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL3 */
#define IFX_CBS_TLTTH_TL3_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL3 */
#define IFX_CBS_TLTTH_TL3_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL3 */
#define IFX_CBS_TLTTH_TL3_OFF (6u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL4 */
#define IFX_CBS_TLTTH_TL4_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL4 */
#define IFX_CBS_TLTTH_TL4_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL4 */
#define IFX_CBS_TLTTH_TL4_OFF (8u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL5 */
#define IFX_CBS_TLTTH_TL5_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL5 */
#define IFX_CBS_TLTTH_TL5_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL5 */
#define IFX_CBS_TLTTH_TL5_OFF (10u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL6 */
#define IFX_CBS_TLTTH_TL6_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL6 */
#define IFX_CBS_TLTTH_TL6_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL6 */
#define IFX_CBS_TLTTH_TL6_OFF (12u)

/** \brief Length for Ifx_CBS_TLTTH_Bits.TL7 */
#define IFX_CBS_TLTTH_TL7_LEN (2u)

/** \brief Mask for Ifx_CBS_TLTTH_Bits.TL7 */
#define IFX_CBS_TLTTH_TL7_MSK (0x3u)

/** \brief Offset for Ifx_CBS_TLTTH_Bits.TL7 */
#define IFX_CBS_TLTTH_TL7_OFF (14u)

/** \brief Length for Ifx_CBS_TCCB_Bits.C0 */
#define IFX_CBS_TCCB_C0_LEN (1u)

/** \brief Mask for Ifx_CBS_TCCB_Bits.C0 */
#define IFX_CBS_TCCB_C0_MSK (0x1u)

