HAMES2-1st-3/TunnelComfortSystemTesting/include/tc39xa/IfxCbs_bf.h
/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx3 */
#define IFX_CBS_TRIG_TRGX3_OFF (3u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx4 */
#define IFX_CBS_TRIG_TRGX4_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx4 */
#define IFX_CBS_TRIG_TRGX4_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx4 */
#define IFX_CBS_TRIG_TRGX4_OFF (4u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx5 */
#define IFX_CBS_TRIG_TRGX5_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx5 */
#define IFX_CBS_TRIG_TRGX5_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx5 */
#define IFX_CBS_TRIG_TRGX5_OFF (5u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx6 */
#define IFX_CBS_TRIG_TRGX6_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx6 */
#define IFX_CBS_TRIG_TRGX6_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx6 */
#define IFX_CBS_TRIG_TRGX6_OFF (6u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx7 */
#define IFX_CBS_TRIG_TRGX7_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx7 */
#define IFX_CBS_TRIG_TRGX7_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx7 */
#define IFX_CBS_TRIG_TRGX7_OFF (7u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx8 */
#define IFX_CBS_TRIG_TRGX8_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx8 */
#define IFX_CBS_TRIG_TRGX8_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx8 */
#define IFX_CBS_TRIG_TRGX8_OFF (8u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx9 */
#define IFX_CBS_TRIG_TRGX9_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx9 */
#define IFX_CBS_TRIG_TRGX9_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx9 */
#define IFX_CBS_TRIG_TRGX9_OFF (9u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx10 */
#define IFX_CBS_TRIG_TRGX10_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx10 */
#define IFX_CBS_TRIG_TRGX10_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx10 */
#define IFX_CBS_TRIG_TRGX10_OFF (10u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx11 */
#define IFX_CBS_TRIG_TRGX11_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx11 */
#define IFX_CBS_TRIG_TRGX11_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx11 */
#define IFX_CBS_TRIG_TRGX11_OFF (11u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx12 */
#define IFX_CBS_TRIG_TRGX12_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx12 */
#define IFX_CBS_TRIG_TRGX12_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx12 */
#define IFX_CBS_TRIG_TRGX12_OFF (12u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx13 */
#define IFX_CBS_TRIG_TRGX13_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx13 */
#define IFX_CBS_TRIG_TRGX13_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx13 */
#define IFX_CBS_TRIG_TRGX13_OFF (13u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx14 */
#define IFX_CBS_TRIG_TRGX14_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx14 */
#define IFX_CBS_TRIG_TRGX14_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx14 */
#define IFX_CBS_TRIG_TRGX14_OFF (14u)

/** \brief Length for Ifx_CBS_TRIG_Bits.TRGx15 */
#define IFX_CBS_TRIG_TRGX15_LEN (1u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.TRGx15 */
#define IFX_CBS_TRIG_TRGX15_MSK (0x1u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.TRGx15 */
#define IFX_CBS_TRIG_TRGX15_OFF (15u)

/** \brief Length for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_LEN (8u)

/** \brief Mask for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_MSK (0x0u)

/** \brief Offset for Ifx_CBS_TRIG_Bits.x */
#define IFX_CBS_TRIG_X_OFF (24u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCBS_BF_H */
